
#"Курс: Python, всего задач:12, затрачено часов: 1.5, среднее время выполнения 0.125 часа.

# Данная программа выводит: "Курс: Python , всего задач: 12 , затрачено часов: 1.5 , среднее время выполнения 0.125 часа."
# Как выполнить слитный вывод в некоторых местах?

#Задание по теме: "Переменные"
summa_dz = 12
summa_time = 1.5
name_course = 'Python'
time_1_dz = summa_time / summa_dz
print('Курс:', name_course, ', всего задач:', summa_dz, ', затрачено часов:', summa_time, ', среднее время выполнения', time_1_dz, 'часа.')